[
{"url": "https://punchng.com/just-in-less-than-n3bn-spent-on-nigeria-air-project-says-sirika/", "title": " Wike now playing game of survival – Nwauju, Rivers APC spokesperson ", "post_date": "\n                            11th June 2023                        ", "author": "Lilian Ukagwu", "content": ["The immediate past Minister of Aviation, Hadi Sirika, has said that less than N3bn was expended on the Nigeria Air project.", "Speaking on Arise TV news program in Abuja on Sunday, the ex-minister stated that contrary to speculations, less than N3bn budgetary allocation has been made to Nigerian Air since the inception of the project.", "According to Sirika, reports suggesting that the sum of N85bn has been spent on the Nigeria Air project are baseless and false, adding that the bulk of the expended funds has been channelled into consultancies, salaries, and administrative costs associated with setting up the national carrier.", "The former minister also disclosed that Nigerian Air would not enjoy any form of special tax privileges, as the taxes presently imposed on other airlines will also apply to Nigeria Air.", "Sirikas’ comment comes following reports of alleged fraud surrounding the Nigeria Air project.", "Details later…"]},
{"url": "https://punchng.com/uefa-champions-league-seven-facts-and-figures-of-citys-win/", "title": " Wike now playing game of survival – Nwauju, Rivers APC spokesperson ", "post_date": "\n                            11th June 2023                        ", "author": "Olaniyi Apanpa", "content": ["Manchester City won their first Uefa Champions League on Saturday night beating Internationale Milan 1-0 at the Ataturk Olympic Stadium in Turkey.\n", "Rodri’s well-taken goal in the 68th was enough to see Citizens become just the second English team to win The Treble after Manchester United in 1999.\n", "City manager Pep Guardiola also claimed his third Champions League trophy and becomes the first manager to win the Treble with two different clubs.\n", "Here are seven other facts behind the game as provided by Opta.", "\n1. Manchester City become the first team since rivals Manchester United in 2007/08 to go a full Champions League campaign unbeaten.", "2. The last four Champions League finals have now all ended 1-0, more than the previous 27 finals combined. ", "3. City striker Julian Alvarez became just the third player this century to win both the World Cup and the Champions League in the same season.\n", "4. Erling Haaland finishes the season as the Champions League top scorer with 12 goals. The Norwegian star also becomes just the fourth player in history to both finishes as both Premier League and UCL top scorer in the same season after Dwight Yorke (1998/99), Ruud Van Nistlerooy (2002/03) and Cristiano Ronaldo (2007/08).", "5. Rodri also became the first central midfielder to score in the Champions League final since Real Madrid’s Casemiro back in 2017.\n", "6. That strike meant that all seven goals scored in the Champions League finals at the Atatürk Olympic Stadium had all come at the same end of the pitch.\n", "7. Manchester City have scored 100+ goals more than they’ve conceded in three of the last five seasons (18-19, 21-22, 22-23) – prior to Pep Guardiola’s arrival, no English top-flight side had ever scored 100+ more than they had conceded in a single campaign.\n                                            "]},
{"url": "https://punchng.com/twitter-to-commence-payment-for-verified-creators-adverts/", "title": " Wike now playing game of survival – Nwauju, Rivers APC spokesperson ", "post_date": "\n                            10th June 2023                        ", "author": "Rotimi Agbana", "content": ["The CEO of Twitter, Elon Musk, has announced that Twitter will soon commence the payment of verified content creators for the adverts they place in their responses, with the first payment block being roughly $5 million.", "Musk, a billionaire who purchased Twitter last October, said in a tweet: “Note, the creator must be verified and only ads served to verified users count.”", "Since the acquisition of Twitter by Elon Musk, the social media network has had trouble retaining advertisers since they are hesitant to place their ads after the company fired off thousands of workers.", "The action is being taken as Twitter’s soon-to-be CEO, Linda Yaccarino, an NBCUniversal advertising veteran, prepares to assume leadership of the social media network.", "Musk claimed in March that the messaging service earns 5 or 6 cents per hour of user attention and might reach 15 cents or more with more timely and relevant adverts."]},
{"url": "https://punchng.com/jigawa-man-commits-suicide-four-months-after-marriage/", "title": " Wike now playing game of survival – Nwauju, Rivers APC spokesperson ", "post_date": "\n                            10th June 2023                        ", "author": "Olaniyi Apanpa", "content": ["A 30-year-old man, Usman Sani Goga, has committed suicide in the Babura Local Government Area of Jigawa State.\n", "The deceased, a photographer who was said to have got married four months ago, hung himself in his bedroom on Wednesday at Akula Quarters of the local government.\n", "Confirming the incident,  CSC. Adamu Shehu, Nigeria Security and Civil Defence Corps spokesman in the state said the deceased had dropped his wife at one of his relative’s house that fateful day around 1400hrs  promising to pick her up later in the evening.\n", "He also said the cause of his action is not known, adding that an investigation is going on to ascertain the reason for his death.", "The wife while narrating the incident said:  “Around 1700hrs, I called his phone severally without response; I later decided to take a commercial vehicle. ", "On reaching home, I realised that I was without keys and decided to call his phone again, yet there was no response.\n", "With the assistance of the motorcyclist, I got access to the house. I then saw my husband’s motorcycle parked which is very unusual.", "I hurried inside where I saw his body hanging from a ceiling fan hook in our bedroom”.\n", " \n                                            "]}
]